In [1]:
import numpy as np
import pandas as pd

# 1. Series

In [3]:
obj = pd.Series([4, 7, 5, -3])

In [4]:
obj

0    4
1    7
2    5
3   -3
dtype: int64

In [5]:
obj.values

array([ 4,  7,  5, -3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj.dtype

dtype('int64')

In [8]:
obj2 = pd.Series([4, 7, 5, -3], index = ['a', 'b', 'c', 'd'])

In [9]:
obj2

a    4
b    7
c    5
d   -3
dtype: int64

In [11]:
data = {"Charles": 35000, "Kilho": 71000, "Hayoung": 420000, "Sangjun": 30000}
obj3 = pd.Series(data)

In [12]:
obj3

Charles     35000
Hayoung    420000
Kilho       71000
Sangjun     30000
dtype: int64

In [13]:
obj3.name = "Salary"
obj3.index.name = "names"
obj3

names
Charles     35000
Hayoung    420000
Kilho       71000
Sangjun     30000
Name: Salary, dtype: int64

In [14]:
obj3.index = ["A", "B", "C", "D"]

In [15]:
obj3

A     35000
B    420000
C     71000
D     30000
Name: Salary, dtype: int64

# 2. DataFrame

In [17]:
data = {"names": ["a", "b", "c", "d", "e"],
        "year": [2014, 2015, 2016, 2017, 2018],
        "points": [1.2, 3.2, 3.3, 4.0, 4.1]}
df = pd.DataFrame(data)

In [18]:
df

  names  points  year
0     a     1.2  2014
1     b     3.2  2015
2     c     3.3  2016
3     d     4.0  2017
4     e     4.1  2018

In [19]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
df.columns

Index(['names', 'points', 'year'], dtype='object')

In [21]:
df.values

array([['a', 1.2, 2014],
       ['b', 3.2, 2015],
       ['c', 3.3, 2016],
       ['d', 4.0, 2017],
       ['e', 4.1, 2018]], dtype=object)

In [22]:
df.index.name = "num"
df.columns.name = "Info"

In [23]:
df

Info names  points  year
num
0        a     1.2  2014
1        b     3.2  2015
2        c     3.3  2016
3        d     4.0  2017
4        e     4.1  2018

In [26]:
df2 = pd.DataFrame(data, columns = ['year', 'name', 'points', 'penalty'],
                         index = ['one', 'two', 'three', 'four', 'five'])

In [27]:
df2

       year name  points penalty
one    2014  NaN     1.2     NaN
two    2015  NaN     3.2     NaN
three  2016  NaN     3.3     NaN
four   2017  NaN     4.0     NaN
five   2018  NaN     4.1     NaN

In [28]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [29]:
df2.columns

Index(['year', 'name', 'points', 'penalty'], dtype='object')

In [30]:
df.values

array([['a', 1.2, 2014],
       ['b', 3.2, 2015],
       ['c', 3.3, 2016],
       ['d', 4.0, 2017],
       ['e', 4.1, 2018]], dtype=object)

In [31]:
df.describe()

Info     points         year
count  5.000000     5.000000
mean   3.160000  2016.000000
std    1.167476     1.581139
min    1.200000  2014.000000
25%    3.200000  2015.000000
50%    3.300000  2016.000000
75%    4.000000  2017.000000
max    4.100000  2018.000000